revert(docs): revert diagram changes for chapters 17, 18, and 19
